astb_relise/src/Documents/ЗачетВыданныхСредствЗащиты/ЗачетВыданныхСредствЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетВыданныхСредствЗащиты</name>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСледующейВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/AccumulationRegisters/ВыданныеСредстваЗащиты/ВыданныеСредстваЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыданныеСредстваЗащиты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НеВыводитьВыдачуВ_ЛК</name>
    <comment>АСТБ_Горюшин_Алексей_19561</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/AccumulationRegisters/ВыдачаПоПотребности/ВыдачаПоПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыдачаПоПотребности</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/Documents/ЗачетВыданныхСредствЗащиты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	// Контроль выполняется при проведении\отмене проведения не нового документа.
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Массив.Добавить(Движения.ВыданныеСредстваЗащиты);
		Массив.Добавить(Движения.ВыдачаПоПотребности);

	КонецЕсли;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	УстановитьПривилегированныйРежим(Истина);
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.ЗачетВыданныхСредствЗащиты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//+++АСТБ_Горюшин_Алексей_19737
	//ПроверитьНаличиеПрошлыхВыдачПоНорме(Ссылка, ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыданныеСредстваЗащиты, Отказ);
	ПроверитьДоступныеОстаткиПоВПП(Ссылка, ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыдачаПоПотребности, Отказ);
	СравнитьОстаткиВППиВыданныхСИЗ(Ссылка, ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыдачаПоПотребности, Отказ);
	//---АСТБ_Горюшин_Алексей_19737
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ЗапасыСерверПереопределяемый.ОтразитьВыданныеСредстваЗащиты(ДополнительныеСвойства, Движения, Отказ);
	ЗапасыСерверПереопределяемый.ОтразитьВыдачуПоПотребности(ДополнительныеСвойства, Движения, Отказ);
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
	//***НСК Трегубов А.А.*** -- №101904  --  31.08.2021 <<<
	ПроверитьНаличиеПрошлыхВыдачПоНорме(Ссылка, ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыданныеСредстваЗащиты, Отказ);	
	//***НСК Трегубов А.А.*** -- №101904  --  31.08.2021 >>>
	
	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//ПроведениеСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,Отказ,"Товары");
	//ПроведениеСервер.ПроверитьЗаполнениеНоменклатурыНормыПоПотребности(ЭтотОбъект,Отказ,"Товары");
	
КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_19737
Процедура ПроверитьНаличиеПрошлыхВыдачПоНорме(ДокументСсылка, ТаблицаВыданныеСредстваЗащиты, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаВыданныеСредстваЗащиты.Организация КАК Организация,
		|	ТаблицаВыданныеСредстваЗащиты.Сотрудник КАК Сотрудник,
		|	ТаблицаВыданныеСредстваЗащиты.НормаВыдачи КАК НормаВыдачи,
		|	ТаблицаВыданныеСредстваЗащиты.Номенклатура КАК Номенклатура,
		|	ТаблицаВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ТаблицаВыданныеСредстваЗащиты.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_ТаблицаВыданныеСредстваЗащиты
		|ИЗ
		|	&ТаблицаВыданныеСредстваЗащиты КАК ТаблицаВыданныеСредстваЗащиты
		|ГДЕ
		|	ТаблицаВыданныеСредстваЗащиты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ВыданныеСредстваЗащиты.Сотрудник КАК Сотрудник
		//|ИЗ
		//|	ВТ_ТаблицаВыданныеСредстваЗащиты КАК ВТ_ТаблицаВыданныеСредстваЗащиты
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
		//|		ПО (ВыданныеСредстваЗащиты.Организация = ВТ_ТаблицаВыданныеСредстваЗащиты.Организация)
		//|			И (ВыданныеСредстваЗащиты.Сотрудник = ВТ_ТаблицаВыданныеСредстваЗащиты.Сотрудник)
		//|			И (ВыданныеСредстваЗащиты.НормаВыдачи = ВТ_ТаблицаВыданныеСредстваЗащиты.НормаВыдачи)
		//|ГДЕ
		//|	НЕ ВыданныеСредстваЗащиты.Сотрудник ЕСТЬ NULL
		//|	И НЕ ВыданныеСредстваЗащиты.Регистратор = &ДокументСсылка
		//|;
		//|
		//***НСК Трегубов А.А.*** -- №101904  --  31.08.2021 <<<
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
		|	ВложенныйЗапрос.НормаВыдачи КАК НормаВыдачи,
		|	СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ВложенныйЗапрос.КоличествоДокумент) КАК КоличествоДокумент
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВыданныеСредстваЗащитыОстатки.Организация КАК Организация,
		|		ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|		ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|		ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|		0 КАК КоличествоДокумент
		|	ИЗ
		|		РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|				&ДатаАнализа,
		|				(Организация, Сотрудник, НормаВыдачи) В
		|					(ВЫБРАТЬ
		|						ВТ_ТаблицаВыданныеСредстваЗащиты.Организация КАК Организация,
		|						ВТ_ТаблицаВыданныеСредстваЗащиты.Сотрудник КАК Сотрудник,
		|						ВТ_ТаблицаВыданныеСредстваЗащиты.НормаВыдачи КАК НормаВыдачи
		|					ИЗ
		|						ВТ_ТаблицаВыданныеСредстваЗащиты КАК ВТ_ТаблицаВыданныеСредстваЗащиты)) КАК ВыданныеСредстваЗащитыОстатки
		|	ГДЕ
		|		ВыданныеСредстваЗащитыОстатки.КоличествоОстаток > 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВТ_ТаблицаВыданныеСредстваЗащиты.Организация,
		|		ВТ_ТаблицаВыданныеСредстваЗащиты.Сотрудник,
		|		ВТ_ТаблицаВыданныеСредстваЗащиты.НормаВыдачи,
		|		0,
		|		ВТ_ТаблицаВыданныеСредстваЗащиты.Количество
		|	ИЗ
		|		ВТ_ТаблицаВыданныеСредстваЗащиты КАК ВТ_ТаблицаВыданныеСредстваЗащиты) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Сотрудник,
		|	ВложенныйЗапрос.НормаВыдачи,
		|	ВложенныйЗапрос.Организация
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.КоличествоОстаток) <> СУММА(ВложенныйЗапрос.КоличествоДокумент)";
		//***НСК Трегубов А.А.*** -- №101904  --  31.08.2021 >>>

	Запрос.УстановитьПараметр("ТаблицаВыданныеСредстваЗащиты", ТаблицаВыданныеСредстваЗащиты);
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Запрос.УстановитьПараметр("ДатаАнализа", Новый Граница(ДокументСсылка.МоментВремени(),ВидГраницы.Включая));
		
	ТЗ_ВыданныеСИЗ = Запрос.Выполнить().Выгрузить();
	
	ШаблонСообщения = "У сотрудника ""%1"" уже есть выдача по норме, на которую производится зачет.";
	
	Для Каждого Строка Из ТЗ_ВыданныеСИЗ Цикл
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%1", Строка.Сотрудник); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЦикла;		
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_19737

//+++АСТБ_Горюшин_Алексей_19737
Процедура ПроверитьДоступныеОстаткиПоВПП(ДокументСсылка, ТаблицаВыдачаПоПотребности, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
	ТаблицаВыдачаПоПотребности_Расход = ТаблицаВыдачаПоПотребности.НайтиСтроки(СтруктураОтбора);
	
	ДатаДокумента = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка);
	
	Для Каждого Строка ИЗ ТаблицаВыдачаПоПотребности_Расход Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
		|			&ДатаДокумента,
		|			Сотрудник = &Сотрудник
		|				И НормаВыдачи = &НормаВыдачи
		|				И НоменклатураНормы = &НоменклатураНормы
		|				И ДатаВыдачи = &ДатаВыдачи
		|				И Организация = &Организация) КАК ВыдачаПоПотребностиОстатки";
		
		Запрос.УстановитьПараметр("ДатаВыдачи", 		Строка.ДатаВыдачи);
		Запрос.УстановитьПараметр("ДатаДокумента", 		ДатаДокумента);
		Запрос.УстановитьПараметр("НоменклатураНормы", 	Строка.НоменклатураНормы);
		Запрос.УстановитьПараметр("НормаВыдачи", 		Строка.НормаВыдачи);
		Запрос.УстановитьПараметр("Организация", 		Строка.Организация);
		Запрос.УстановитьПараметр("Сотрудник", 			Строка.Сотрудник);         	
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРезультата ИЗ РезультатЗапроса Цикл
			ШаблонСообщения = "На дату выдачи %1 есть лишние выдачи по потребности. Обратитесь в техподдержку.";
			Если СтрокаРезультата.Количество < Строка.Количество Тогда
				 ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%1", Формат(Строка.ДатаВыдачи,"ДФ=dd.MM.yyyy"));
				 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_19737

//+++АСТБ_Горюшин_Алексей_19737
Процедура СравнитьОстаткиВППиВыданныхСИЗ(ДокументСсылка, ТаблицаВыдачаПоПотребности, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
	ТаблицаВыдачаПоПотребности_Расход = ТаблицаВыдачаПоПотребности.НайтиСтроки(СтруктураОтбора);
	
	ДатаДокумента = ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ДокументСсылка);
	
	Для Каждого Строка ИЗ ТаблицаВыдачаПоПотребности_Расход Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыдачаПоПотребностиОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВыдачаПоПотребностиОстатки.Организация КАК Организация,
		|	ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
		|	ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи
		|ПОМЕСТИТЬ ВТ_ВыдачаПоПотребностиОстатки
		|ИЗ
		|	РегистрНакопления.ВыдачаПоПотребности.Остатки(
		|			&ДатаДокумента,
		|			Сотрудник = &Сотрудник
		//|				И НормаВыдачи = &НормаВыдачи
		|				И НоменклатураНормы = &НоменклатураНормы
		|				И ДатаВыдачи = &ДатаВыдачи
		|				И Организация = &Организация) КАК ВыдачаПоПотребностиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыданныеСредстваЗащитыОстатки.Организация КАК Организация,
		|	ВыданныеСредстваЗащитыОстатки.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащитыОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащитыОстатки.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыданныеСредстваЗащитыОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ВыданныеСредстваЗащитыОстатки
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты.Остатки(
		|			&ДатаДокумента,
		|			Сотрудник = &Сотрудник
		//|				И НормаВыдачи = &НормаВыдачи
		|				И НоменклатураНормы = &НоменклатураНормы
		|				И ДатаВыдачи = &ДатаВыдачи
		|				И Организация = &Организация) КАК ВыданныеСредстваЗащитыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыдачаПоПотребностиОстатки.КоличествоОстаток - ЕСТЬNULL(ВТ_ВыданныеСредстваЗащитыОстатки.КоличествоОстаток, 0) КАК Количество,
		|	ВТ_ВыдачаПоПотребностиОстатки.Организация КАК Организация,
		|	ВТ_ВыдачаПоПотребностиОстатки.Сотрудник КАК Сотрудник,
		|	ВТ_ВыдачаПоПотребностиОстатки.НормаВыдачи КАК НормаВыдачи,
		|	ВТ_ВыдачаПоПотребностиОстатки.НоменклатураНормы КАК НоменклатураНормы,
		|	ВТ_ВыдачаПоПотребностиОстатки.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	ВТ_ВыдачаПоПотребностиОстатки КАК ВТ_ВыдачаПоПотребностиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыданныеСредстваЗащитыОстатки КАК ВТ_ВыданныеСредстваЗащитыОстатки
		|		ПО ВТ_ВыдачаПоПотребностиОстатки.Организация = ВТ_ВыданныеСредстваЗащитыОстатки.Организация
		|			И ВТ_ВыдачаПоПотребностиОстатки.Сотрудник = ВТ_ВыданныеСредстваЗащитыОстатки.Сотрудник
		//|			И ВТ_ВыдачаПоПотребностиОстатки.НормаВыдачи = ВТ_ВыданныеСредстваЗащитыОстатки.НормаВыдачи
		|			И ВТ_ВыдачаПоПотребностиОстатки.НоменклатураНормы = ВТ_ВыданныеСредстваЗащитыОстатки.НоменклатураНормы
		|			И ВТ_ВыдачаПоПотребностиОстатки.ДатаВыдачи = ВТ_ВыданныеСредстваЗащитыОстатки.ДатаВыдачи";
		
		Запрос.УстановитьПараметр("ДатаВыдачи", 		Строка.ДатаВыдачи);
		Запрос.УстановитьПараметр("ДатаДокумента", 		ДатаДокумента);
		Запрос.УстановитьПараметр("НоменклатураНормы", 	Строка.НоменклатураНормы);
		Запрос.УстановитьПараметр("НормаВыдачи", 		Строка.НормаВыдачи);
		Запрос.УстановитьПараметр("Организация", 		Строка.Организация);
		Запрос.УстановитьПараметр("Сотрудник", 			Строка.Сотрудник);         	
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРезультата ИЗ РезультатЗапроса Цикл
			ШаблонСообщения = "На дату выдачи %1 превышен остаток выданных СИЗ. Обратитесь в техподдержку.";
			Если СтрокаРезультата.Количество > 0 Тогда
				 ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%1", Формат(Строка.ДатаВыдачи,"ДФ=dd.MM.yyyy"));
				 ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_19737

#КонецЕсли
